{"config": [{"config": {"batch_input_shape": [null, null], "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "trainable": true, "dtype": "int32", "name": "embedding_4", "mask_zero": false, "input_dim": 572, "output_dim": 100, "embeddings_constraint": null, "activity_regularizer": null, "embeddings_regularizer": null, "input_length": null}, "class_name": "Embedding"}, {"config": {"dilation_rate": [1], "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5], "filters": 64, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv1d_4", "kernel_regularizer": null, "activation": "relu", "bias_constraint": null, "strides": [1], "kernel_constraint": null, "activity_regularizer": null, "padding": "same"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "implementation": 0, "stateful": false, "activation": "tanh", "dropout": 0.0, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "trainable": true, "use_bias": true, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "gru_4", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 100, "activity_regularizer": null, "go_backwards": false}, "class_name": "GRU"}, {"config": {"trainable": true, "layer": {"config": {"trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "units": 127, "activity_regularizer": null}, "class_name": "Dense"}, "name": "time_distributed_4"}, "class_name": "TimeDistributed"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}